test_config/cfe/InformationRegisters/AVS_СоставКатегорийНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>AVS_СоставКатегорийНоменклатуры</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>СвязкаАктивна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Категория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.AVS_КатегорииНоменклатурыСайт</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

test_config/cfe/CommonModules/AVS_ПриЗаписиНоменклатуры/Ext/Module.bsl
// { ПРАВКА: Регистрация только товаров сайта + корректный INSERT/UPDATE }

Процедура AVS_ПриЗаписиНоменклатурыПередЗаписью(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;
	Источник.ДополнительныеСвойства.Вставить("AVS_ЭтоНовый", Источник.ЭтоНовый());
	
	// 16.04.2026 { ПРАВКА: Проверка реальных изменений значимых полей }
	Если Не Источник.ЭтоНовый() Тогда
		Реквизиты = "Наименование, Артикул, ПометкаУдаления, ВидНоменклатуры";
		СтарыеДанные = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Источник.Ссылка, Реквизиты);
		
		Изменено = (Источник.Наименование    <> СтарыеДанные.Наименование)
		        Или (Источник.Артикул         <> СтарыеДанные.Артикул)
		        Или (Источник.ПометкаУдаления <> СтарыеДанные.ПометкаУдаления)
		        Или (Источник.ВидНоменклатуры <> СтарыеДанные.ВидНоменклатуры);
				
		Источник.ДополнительныеСвойства.Вставить("AVS_ДанныеИзменены", Изменено);
	КонецЕсли;
	
КонецПроцедуры

Процедура AVS_ПриЗаписиНоменклатурыПриЗаписи(Источник, Отказ) Экспорт
    
    Если Источник.ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;
    
	// ПРОВЕРКА: Если товар не привязан к категориям сайта, он нам в регистре не нужен
	Если Не AVS_ОбщийМодульСайт.ТоварПривязанККатегориям(Источник.Ссылка) Тогда
		Возврат;
	КонецЕсли;

	ЭтоНовый = Ложь;
	Источник.ДополнительныеСвойства.Свойство("AVS_ЭтоНовый", ЭтоНовый);

    // { ПРАВКА: Считываем флаг изменений }
	ДанныеИзменены = Ложь;
	Источник.ДополнительныеСвойства.Свойство("AVS_ДанныеИзменены", ДанныеИзменены);

    Если Источник.ПометкаУдаления Тогда
        Вид = "DELETE";
    ИначеЕсли ЭтоНовый Тогда
        Вид = "INSERT";
    ИначеЕсли ДанныеИзменены Тогда // Регистрируем только если было изменение
        Вид = "UPDATE"; 
	Иначе
		Возврат; // Данные не менялись, РИКС не трогаем
    КонецЕсли;
    
    AVS_ОбщийМодульСайт.AVS_ЗарегистрироватьИзменение(Источник.Ссылка, Вид);
    
КонецПроцедуры    

// Регистрирует изменение товара для сайта (вызывается при изменении состава категорий или цен)
Процедура ЗарегистрироватьИзменениеТовара(Товар, ЖелаемыйВид = "") Экспорт
	
	Если Не ЗначениеЗаполнено(Товар) Тогда Возврат; КонецЕсли;
	
	// 1. Проверяем, осталась ли у товара хотя бы одна АКТИВНАЯ категория
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ ПЕРВЫЕ 1
	|	Состав.Номенклатура
	|ИЗ
	|	РегистрСведений.AVS_СоставКатегорийНоменклатуры КАК Состав
	|ГДЕ
	|	Состав.Номенклатура = &Товар
	|	И Состав.СвязкаАктивна = ИСТИНА
	|	И НЕ Состав.Категория.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Товар", Товар);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		// Активных связей нет -> Товар должен быть удален с сайта
		ВидСобытия = "DELETE";
	Иначе
		// Есть активные связи -> Товар должен быть обновлен (или создан, если его еще нет)
		ВидСобытия = ?(ЗначениеЗаполнено(ЖелаемыйВид), ЖелаемыйВид, "UPDATE");
	КонецЕсли;
	
	AVS_ОбщийМодульСайт.AVS_ЗарегистрироватьИзменение(Товар, ВидСобытия);
	
КонецПроцедуры

// Физическое удаление товара
Процедура AVS_ПриЗаписиНоменклатурыПередУдалением(Источник, Отказ) Экспорт
	Если Источник.ОбменДанными.Загрузка Тогда Возврат; КонецЕсли;
	
	// Если удаляемый товар был на сайте - сообщаем об этом
	Если AVS_ОбщийМодульСайт.ТоварПривязанККатегориям(Источник.Ссылка) Тогда
		AVS_ОбщийМодульСайт.AVS_ЗарегистрироватьИзменение(Источник.Ссылка, "DELETE");
	КонецЕсли;
КонецПроцедуры
